mhoikka/RC_Receiver_stm32/src/Peripheral_Init.c
  GPIO_InitTypeDef GPIO_InitStruct2;
  GPIO_InitStruct2.GPIO_Pin = GPIO_Pin_11;
  GPIO_InitStruct2.GPIO_Mode = GPIO_Mode_OUT;
  GPIO_InitStruct2.GPIO_Speed = GPIO_Speed_50MHz; // High speed
  GPIO_InitStruct2.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStruct2.GPIO_PuPd = GPIO_PuPd_DOWN;
  GPIO_Init(GPIOC, &GPIO_InitStruct2);

  GPIO_InitTypeDef GPIO_InitStruct3;
  GPIO_InitStruct3.GPIO_Pin = GPIO_Pin_2;
  GPIO_InitStruct3.GPIO_Mode = GPIO_Mode_OUT;
  GPIO_InitStruct3.GPIO_Speed = GPIO_Speed_50MHz; // High speed
  GPIO_InitStruct3.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStruct3.GPIO_PuPd = GPIO_PuPd_DOWN;
  GPIO_Init(GPIOD, &GPIO_InitStruct3);
}

/**
 * * @brief Initializes all of the peripherals necessary to control the servo motors using the STM32 chip
 * @retval None
 */
void Servo_Peripherals_Init(){

  RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOB, ENABLE); // enable clocks for GPIO peripheral
  RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOC, ENABLE);

  // Enable pin to control LFlap
  GPIO_InitTypeDef GPIO_InitStruct;
  // Currently only the LFlap control pin C13 is set up here for testing
  GPIO_InitStruct.GPIO_Pin = GPIO_Pin_13;
  GPIO_InitStruct.GPIO_Mode = GPIO_Mode_OUT;
  GPIO_InitStruct.GPIO_Speed = GPIO_Speed_50MHz; // High speed
  GPIO_InitStruct.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStruct.GPIO_PuPd = GPIO_PuPd_DOWN;
  GPIO_Init(GPIOC, &GPIO_InitStruct);

  // Enable pin to control test diode
  GPIO_InitTypeDef GPIO_InitStruct2;
  GPIO_InitStruct2.GPIO_Pin = GPIO_Pin_12;
  GPIO_InitStruct2.GPIO_Mode = GPIO_Mode_OUT;
  GPIO_InitStruct2.GPIO_Speed = GPIO_Speed_50MHz; // High speed
  GPIO_InitStruct2.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStruct2.GPIO_PuPd = GPIO_PuPd_DOWN;
  GPIO_Init(GPIOB, &GPIO_InitStruct2);
}

/**
 * @brief Tests the servo motor, currently only set up for LFlap #TODO fix that TODO add support for changing angle of servo arm as well
 * @param angle In range 0-4 inclusive and specifies the angle of the servo motor arm by the equation 45 * angle, with units of degrees
 * Note that two of the servo motors used are different and don't need to exceed the specified PWM time spans to fire to the specified angle, as the SG90 do
 */
void DriveServoControl(uint8_t angle){ 
  GPIO_SetBits(GPIOB, GPIO_Pin_12); // Turn on test diode to confirm setup function worked
  uint32_t time_on = 0;
  for(int i = 0; i < 6000; i++){ // TODO test how fast loaded arm moves, unloaded arm is rated to move at 0.09 s + 0.01 s/60 degrees at 4.8 V so I gave it 150 ms here
    GPIO_SetBits(GPIOC, GPIO_Pin_13); // Servo uses PWM to control angle of arm
    time_on = 800 + angle * 500; // in microseconds
    delay_microseconds(time_on, NULL); // exceeds 1000 or 1500 ms (45-90 degree angle for servo arm) as specified to ensure motor operates
    GPIO_ResetBits(GPIOC, GPIO_Pin_13);
    delay_microseconds(20000 - time_on, NULL);
  }
  
}

/**
 * @brief Repeatedly cycle the control signals for the H-bridge to control the AC voltage for the electric motor (square waves, three phase AC)
 * @param Period The period of the on-off control signal cycle in microseconds
 * @retval None
 */
void DriveACMotorVoltageController(uint32_t Period){

  uint32_t halfPeriod = Period/2;
  uint32_t thirdPeriod = Period/3;
  uint32_t sixthPeriod = Period/6;
  
  while(TRUE){ // TODO test if there should be a time delay between S1 turning off and S2 turning on and vice versa (there should be a GPIO pin voltage rise and fall time of 125 ns max)
    GPIO_SetBits(GPIOB, GPIO_Pin_6); // S1 on

    delay_microseconds(sixthPeriod, NULL); // 1/6 period elapsed 
    GPIO_ResetBits(GPIOD, GPIO_Pin_2); // S5 off
    GPIO_SetBits(GPIOC, GPIO_Pin_11); // S6 on

    delay_microseconds(thirdPeriod-sixthPeriod, NULL); // 1/3 period elapsed (delay timings are computed like this to avoid rounding errors from integer division truncations)
    GPIO_ResetBits(GPIOB, GPIO_Pin_3); // S4 off
    GPIO_SetBits(GPIOB, GPIO_Pin_4); // S3 on

    delay_microseconds(halfPeriod - thirdPeriod, NULL); // 1/2 period elapsed
    GPIO_ResetBits(GPIOB, GPIO_Pin_6); // S1 off
    GPIO_SetBits(GPIOB, GPIO_Pin_5); // S2 on

    delay_microseconds(2*thirdPeriod - halfPeriod, NULL); // 2/3 period elapsed
    GPIO_ResetBits(GPIOC, GPIO_Pin_11); // S6 off
    GPIO_SetBits(GPIOD, GPIO_Pin_2); // S5 on

    delay_microseconds(sixthPeriod, NULL); // 5/6 period elapsed
    GPIO_ResetBits(GPIOB, GPIO_Pin_4); // S3 off
    GPIO_SetBits(GPIOB, GPIO_Pin_3); // S4 on
    
    delay_microseconds(Period-(sixthPeriod+2*thirdPeriod), NULL); // Full period elapsed
    GPIO_ResetBits(GPIOB, GPIO_Pin_5); // S2 off
  }
}

/**
 * @brief  Initializes the I2C1 communication
 * @retval None
 */
void I2C_Settings_Init(){

  // Enable peripheral clock
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_I2C1, ENABLE);
  //RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);//
  RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOB, ENABLE);
  
  // Use pins PB6 and PB7 for I2C (STM32F030R8)
  GPIO_InitTypeDef GPIO_InitStruct; 
  GPIO_PinAFConfig(GPIOB, GPIO_PinSource6, GPIO_AF_1);
  GPIO_PinAFConfig(GPIOB, GPIO_PinSource7, GPIO_AF_1); 
  GPIO_InitStruct.GPIO_Pin = GPIO_Pin_6 | GPIO_Pin_7;
  GPIO_InitStruct.GPIO_Mode = GPIO_Mode_AF;
  GPIO_InitStruct.GPIO_Speed = GPIO_Speed_50MHz; 
  GPIO_InitStruct.GPIO_OType = GPIO_OType_OD;
  GPIO_InitStruct.GPIO_PuPd = GPIO_PuPd_UP;
  GPIO_Init(GPIOB, &GPIO_InitStruct);
	
  // I2C configuration
  I2C_InitTypeDef I2C_InitStruct;
  I2C_InitStruct.I2C_Mode = I2C_Mode_I2C;
  I2C_InitStruct.I2C_AnalogFilter = I2C_AnalogFilter_Enable;
  I2C_InitStruct.I2C_DigitalFilter = 0x00;
  I2C_InitStruct.I2C_Timing = 0x00901D23; 
  I2C_Init(I2C1, &I2C_InitStruct);
  I2C_Cmd(I2C1, ENABLE);

  ctx.I2C_InitStruct = &I2C_InitStruct;
  ctx.i2c_address = BME280_I2C_ADDR_SEC; // Set the secondary I2C address
}

uint8_t* nrf24_read_register(uint8_t reg) {
    uint8_t txData[2]; // Transmit data buffer
    uint8_t rxData[2]; // Receive data buffer

    // Prepare command to read (register address with read command bit)
    txData[0] = reg | READ_COMMAND; // Read command 
    txData[1] = 0x00; // Dummy byte for clocking out data

    // Set CSN low to start communication
    set_nrf24_SPI_CSN(0);
    
    // Start SPI transmission and reception
    for (int i = 0; i < 2; i++) {
        // Transmit byte
        *(__IO uint8_t*)(&SPI1->DR) = txData[i];

        // Wait until transmission is complete
        while (!(SPI1->SR & SPI_SR_RXNE)); // Wait until receive buffer is not empty

        // Read received byte
        rxData[i] = SPI1->DR; // Read received data
    }

    // Set CSN high to end communication
    set_nrf24_SPI_CSN(1);
    return rxData[1]; // Return the value read from the register
}

void nrf24_write_register(uint8_t reg, uint8_t value) {
    uint8_t txData[2]; // Transmit data buffer

    // Prepare command to write (register address with write command prefix)
    txData[0] = reg | WRITE_COMMAND; // Write command
    txData[1] = value;      // Data to write

    // Set CSN low to start communication
    set_nrf24_SPI_CSN(0);
    
    
    // Start SPI transmission
    for (int i = 0; i < 2; i++) {
        // Transmit byte
        *(__IO uint8_t*)(&SPI1->DR) = txData[i]; 

        // Wait until transmission is complete
        while (!(SPI1->SR & SPI_SR_RXNE)); // Wait until receive buffer is not empty

        // Read received byte (not used, but necessary to complete the transaction) 
        (void)SPI1->DR; 
    }

    // Set CSN high to end communication
    set_nrf24_SPI_CSN(1);
}

/** 
* @brief: Writes data to a register
* @param: reg register to write to
* @param: values array of uint8_t data to be transmitted
* @param: num_bytes number of bytes to be transmitted
*/
void nrf24_multiwrite_register(uint8_t reg, uint8_t *values, uint8_t num_bytes) {
    uint8_t txData[num_bytes+1]; // Transmit data buffer

    // Prepare command to write (register address with write command prefix)
    txData[0] = reg | WRITE_COMMAND; // Write command
    memcpy(&txData[1], values, num_bytes); // Copy data to write into buffer

    // Set CSN low to start communication
    set_nrf24_SPI_CSN(0);
    
    // Start SPI transmission
    for (int i = 0; i < num_bytes+1; i++) {
        // Transmit byte
        *(__IO uint8_t*)(&SPI1->DR) = txData[i]; 

        // Wait until transmission is complete
        while (!(SPI1->SR & SPI_SR_RXNE)); // Wait until receive buffer is not empty

        // Read received byte (not used, but necessary to complete the transaction) 
        (void)SPI1->DR; 
    }

    // Set CSN high to end communication
    set_nrf24_SPI_CSN(1);
}

/** 
* @brief: Writes a byte of data to the TX FIFO
* @param: value: array of data to be transmitted
* @param: ack: 1 if the data is to be acknowledged, 0 if not
* @param: len: length of the data to be transmitted
*/
//TODO make this capable of transmitting more than one byte
void nrf24_write_TX_payload(uint8_t * value, int ack, int len) {
    uint8_t txData[len+1]; // Transmit data buffer

    // Prepare command to write (register address with write command prefix)
    txData[0] = ack ?  WRITE_PAYLOAD_COMMAND: WRITE_PAYLOAD_NOACK; // Write command
    //txData[1] = value;                 // Data to write
    for (int i = 0; i < len; i++) {
        txData[i+1] = value[i];
    }
    // Set CSN low to start communication
    set_nrf24_SPI_CSN(0);
    
    // Start SPI transmission
    for (int i = 0; i < (len+1); i++) {
        // Transmit byte
        while (!(SPI1->SR & SPI_SR_TXE)); 
        *(__IO uint8_t*)(&SPI1->DR) = txData[i]; 

        // Wait until transmission is complete
        
